/**
 * Created by aleksandr on 04.11.16.
 */
/* Task 1
1. Можете ли вы сопоставить Таблицы (SQL) и Массива (JS) с точки зрения заложенных идей? Что между ними общего и каковы различия?
  Массивы могут хранить разные объекты, не ограниченые типа полей SQL.
2. Какие БД вам знакомы? Какие критерии выбора БД вы можете предложить?
  Mysql и Sqlite. Для девелоперской среды sqlite намного проще, требует минимального администрирования. Mysql - для продакшина.
3. Какую БД вы выбрали бы для (бизнес-версии) вашего проекта? Почему?
  Пока Mysql, с другими дела не имел.

   Task 2.
1.Объясните, своими словами, что такое объекты первого класса?
  Объекты, которые можно присваивать переменной, передавать как значение функции, возвращать как результат.
2. В чём разница между статической и динамической типизацией? Какие преимущества той и другой, с вашей точки зрения?
  Динамическая типизация позволяет менять тип переменной в разных частях программы.
  Плюсы: не нужно задействовать лишний раз
    функции для конвертирования данных переменной для операций сравнения, либо присоединения чисел к строкам.
   Минусы: Прии написании нового кода, нужно следить, чтобы смена типа переменной не повредила функционал программы
3. Чем отличаются понятия Модели и Типа?
  Типы описывают данные. Модель описывает данные в рамках той или иной БД. Модель усложняет описание реальных связей между обьектами.
4.Для чего можно использовать Типы первого класса?
  Не понял вопроса.
 */
